---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailLengthParam
source: html/bcdb5838-e7e8-1273-e76e-847d907e2e8f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailLengthParam Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailLengthParam { get; }
```